esp-cpp/espp/components/esp32-p4-module-dev-kit/src/video.cpp
// Number of bytes lv_draw_sw_rotate() writes to the destination for a src_w x
// src_h source area: the destination stride (which LVGL rounds up to
// LV_DRAW_BUF_STRIDE_ALIGN, so it may exceed dst_width * bytes-per-pixel)
// times the destination height. 90/270 swap the dimensions; 180 keeps them.
static size_t rotated_dest_size_bytes(int32_t src_w, int32_t src_h, lv_display_rotation_t rotation,
                                      lv_color_format_t cf) {
  const int32_t dst_w = (rotation == LV_DISPLAY_ROTATION_180) ? src_w : src_h;
  const int32_t dst_h = (rotation == LV_DISPLAY_ROTATION_180) ? src_h : src_w;
  return static_cast<size_t>(lv_draw_buf_width_to_stride(dst_w, cf)) * static_cast<size_t>(dst_h);
}

bool Esp32P4ModuleDevKit::initialize_display(size_t pixel_buffer_size) {
  if (pixel_buffer_size == 0) {
    pixel_buffer_size = display_width_ * 50;
  }
  logger_.info("Initializing LVGL display with pixel buffer size: {} pixels", pixel_buffer_size);
  if (!display_) {
    display_ = std::make_shared<Display<Pixel>>(
        Display<Pixel>::LvglConfig{.width = display_width_,
                                   .height = display_height_,
                                   .flush_callback =
                                       std::bind_front(&Esp32P4ModuleDevKit::flush, this),
                                   .rotation_callback = nullptr,
                                   .rotation = rotation},
        Display<Pixel>::OledConfig{
            .set_brightness_callback =
                [this](float brightness) { this->brightness(brightness * 100.0f); },
            .get_brightness_callback = [this]() { return this->brightness() / 100.0f; }},
        Display<Pixel>::DynamicMemoryConfig{
            .pixel_buffer_size = pixel_buffer_size,
            .double_buffered = true,
            // Allocate the LVGL draw buffers in PSRAM to keep these large buffers
            // out of internal SRAM. The CPU-copy flush reads them coherently.
            .allocation_flags = MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT,
        },
        Logger::Verbosity::WARN);
  }
  // Cache the raw LVGL display handle for the DPI trans-done callback, which
  // may run in ISR context and therefore must not touch the shared_ptr.
  lvgl_display_.store(display_->get_lvgl_display(), std::memory_order_release);

  // Rotation scratch buffer (only used when the display is rotated). Allocate it
  // once and reuse it across re-inits so re-initialization does not leak PSRAM;
  // if it fails, flush() detects the null pointer and simply skips rotation.
  // Size it for the source pixels plus headroom for destination-stride
  // alignment padding: lv_draw_sw_rotate() writes dst_stride * dst_height
  // bytes, and the stride may be rounded up to LV_DRAW_BUF_STRIDE_ALIGN. The
  // destination height is at most the larger display dimension, and each row
  // carries at most (LV_DRAW_BUF_STRIDE_ALIGN - 1) bytes of padding.
  constexpr size_t row_pad_bytes =
      (LV_DRAW_BUF_STRIDE_ALIGN > 1) ? (LV_DRAW_BUF_STRIDE_ALIGN - 1) : 0;
  const size_t required_bytes = pixel_buffer_size * sizeof(uint16_t) +
                                std::max(display_width_, display_height_) * row_pad_bytes;
  if (third_buffer == nullptr || required_bytes > third_buffer_bytes) {
    if (third_buffer != nullptr) {
      heap_caps_free(third_buffer);
      third_buffer = nullptr;
      third_buffer_bytes = 0;
    }
    third_buffer =
        (uint16_t *)heap_caps_malloc(required_bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    third_buffer_bytes = (third_buffer != nullptr) ? required_bytes : 0;
    if (third_buffer == nullptr) {
      logger_.warn("Could not allocate the {}-byte display rotation buffer; rotation disabled",
                   required_bytes);
    }
  }

  logger_.info("LVGL display initialized");
  return true;
}

size_t Esp32P4ModuleDevKit::rotated_display_width() const {
  // Query the BSP-managed LVGL display (not the global default, which may be a
  // different display in a multi-display app). Before initialize_display()
  // there is no LVGL display yet, so report the unrotated width.
  auto rot = LV_DISPLAY_ROTATION_0;
  if (lv_display_t *disp = lvgl_display_.load(std::memory_order_acquire); disp != nullptr) {
    rot = lv_display_get_rotation(disp);
  }
  switch (rot) {
  case LV_DISPLAY_ROTATION_90:
  case LV_DISPLAY_ROTATION_270:
    return display_height_;
  default:
    return display_width_;
  }
}

size_t Esp32P4ModuleDevKit::rotated_display_height() const {
  // See rotated_display_width(): use the BSP-managed LVGL display, not the
  // global default.
  auto rot = LV_DISPLAY_ROTATION_0;
  if (lv_display_t *disp = lvgl_display_.load(std::memory_order_acquire); disp != nullptr) {
    rot = lv_display_get_rotation(disp);
  }
  switch (rot) {
  case LV_DISPLAY_ROTATION_90:
  case LV_DISPLAY_ROTATION_270:
    return display_width_;
  default:
    return display_height_;
  }
}

void Esp32P4ModuleDevKit::write_lcd_lines(int xs, int ys, int xe, int ye, const uint8_t *data,
                                          uint32_t user_data) {
  (void)user_data;
  if (lcd_handles_.panel == nullptr || data == nullptr) {
    return;
  }
  if (xs < 0 || ys < 0 || xe < xs || ye < ys) {
    logger_.error("write_lcd_lines: Bad region: ({},{}) to ({},{})", xs, ys, xe, ye);
    return;
  }
  esp_lcd_panel_draw_bitmap(lcd_handles_.panel, xs, ys, xe + 1, ye + 1, data);
}

void Esp32P4ModuleDevKit::brightness(float brightness) {
  // The ESP32-P4-Module-DEV-KIT has NO backlight GPIO. The backlight is driven by an
  // on-board I2C controller at address 0x45. On the 10.1" JD9365 panel the
  // brightness register is 0x96 (value 0-255); Waveshare's own BSP writes 0x86
  // instead for some panel revisions. For panels other than the JD9365 the
  // chip/protocol has not been verified, so this remains best-effort: store
  // the requested value so brightness() reads back what was set, and log it.
  brightness = std::clamp(brightness, 0.0f, 100.0f);
  brightness_ = brightness;
  if (display_controller_ != DisplayController::JD9365) {
    logger_.debug("brightness({}) requested; no backlight GPIO on this board (on-board I2C "
                  "backlight protocol not verified for this panel), value stored only",
                  brightness);
    return;
  }
  // Lazily create the backlight I2C device on the internal bus.
  if (!backlight_i2c_device_) {
    std::error_code ec;
    backlight_i2c_device_ = internal_i2c_.add_device<uint8_t>(
        {
            .device_address = backlight_i2c_address,
            .timeout_ms = static_cast<int>(internal_i2c_.config().timeout_ms),
            .scl_speed_hz = internal_i2c_.config().clk_speed,
            .log_level = espp::Logger::Verbosity::WARN,
        },
        ec);
    if (!backlight_i2c_device_) {
      logger_.error("Could not initialize backlight I2C device (0x{:02X}): {}",
                    backlight_i2c_address, ec.message());
      return;
    }
  }
  // Register 0x96 is the brightness register (0-255) on the 10.1" JD9365
  // panel's power/backlight controller (Waveshare's BSP uses 0x86 for some
  // panel revisions).
  const uint8_t data[2] = {0x96, static_cast<uint8_t>(255.0f * brightness / 100.0f)};
  std::error_code ec;
  if (!backlight_i2c_device_->write(data, sizeof(data), ec)) {
    logger_.error("Failed to write backlight brightness: {}", ec.message());
  }
}

float Esp32P4ModuleDevKit::brightness() const { return brightness_.load(); }

void Esp32P4ModuleDevKit::flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
  if (lcd_handles_.panel == nullptr) {
    lv_display_flush_ready(disp);
    return;
  }

