esp-cpp/espp/components/esp32-p4-module-dev-kit/src/video.cpp
  int offsetx1 = area->x1;
  int offsetx2 = area->x2;
  int offsety1 = area->y1;
  int offsety2 = area->y2;

  // Use the display actually being flushed (the callback argument), not the
  // global default display, so the correct rotation is applied even if another
  // LVGL display is the default.
  auto rot = lv_display_get_rotation(disp);
  int32_t ww = lv_area_get_width(area);
  int32_t hh = lv_area_get_height(area);
  lv_color_format_t cf = lv_display_get_color_format(disp);
  // Only rotate when the rotated area fits the scratch buffer; otherwise skip
  // rotation for this flush (fall back to unrotated) to avoid overflowing it.
  // The bound is what lv_draw_sw_rotate() actually writes — the (possibly
  // alignment-padded) destination stride times the destination height — not
  // just ww * hh pixels.
  if (rot > LV_DISPLAY_ROTATION_0 && third_buffer != nullptr &&
      rotated_dest_size_bytes(ww, hh, rot, cf) <= third_buffer_bytes) {
    uint32_t w_stride = lv_draw_buf_width_to_stride(ww, cf);
    uint32_t h_stride = lv_draw_buf_width_to_stride(hh, cf);
    if (rot == LV_DISPLAY_ROTATION_180) {
      // 180° keeps the source dimensions (unlike 90/270), so pass ww/hh and the
      // width-based stride for both source and destination.
      lv_draw_sw_rotate(px_map, third_buffer, ww, hh, w_stride, w_stride, LV_DISPLAY_ROTATION_180,
                        cf);
    } else if (rot == LV_DISPLAY_ROTATION_90) {
      lv_draw_sw_rotate(px_map, third_buffer, ww, hh, w_stride, h_stride, LV_DISPLAY_ROTATION_90,
                        cf);
    } else if (rot == LV_DISPLAY_ROTATION_270) {
      lv_draw_sw_rotate(px_map, third_buffer, ww, hh, w_stride, h_stride, LV_DISPLAY_ROTATION_270,
                        cf);
    }
    px_map = reinterpret_cast<uint8_t *>(third_buffer);
    // Rotate a local copy of the area; LVGL provides a const area* and mutating
    // it via const_cast would be undefined behavior.
    lv_area_t rotated = *area;
    lv_display_rotate_area(disp, &rotated);
    offsetx1 = rotated.x1;
    offsetx2 = rotated.x2;
    offsety1 = rotated.y1;
    offsety2 = rotated.y2;
  }

  esp_lcd_panel_draw_bitmap(lcd_handles_.panel, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1,
                            px_map);
}

bool IRAM_ATTR Esp32P4ModuleDevKit::notify_lvgl_flush_ready(esp_lcd_panel_handle_t panel,
                                                            esp_lcd_dpi_panel_event_data_t *edata,
                                                            void *user_ctx) {
  (void)panel;
  (void)edata;
  // Context: on the JD9365 path (DMA2D enabled) esp_lcd invokes this from the
  // DMA2D transfer-done ISR (async_fbcpy_done_cb); on the CPU-copy path
  // (ILI9881C / EK79007) it is invoked synchronously from the task calling
  // esp_lcd_panel_draw_bitmap(). Keep it ISR-safe: read only the cached raw
  // lv_display_t* (no shared_ptr member access, so no refcount/heap ops) and
  // call lv_display_flush_ready(), which just clears the display's flushing
  // flag — the same thing esp_lvgl_port does from this callback. It wakes no
  // task, so no yield is requested.
  auto *board = static_cast<espp::Esp32P4ModuleDevKit *>(user_ctx);
  if (board == nullptr) {
    return false;
  }
  lv_display_t *disp = board->lvgl_display_.load(std::memory_order_acquire);
  if (disp != nullptr) {
    lv_display_flush_ready(disp);
  }
  return false;
}

void Esp32P4ModuleDevKit::dsi_write_command(uint8_t cmd, std::span<const uint8_t> params,
                                            uint32_t /*flags*/) {
  if (!lcd_handles_.io) {
    logger_.error("DSI write_command does not have a valid IO handle");
    return;
  }
  esp_err_t err =
      esp_lcd_panel_io_tx_param(lcd_handles_.io, (int)cmd, params.data(), params.size());
  if (err != ESP_OK) {
    logger_.error("DSI write_command 0x{:02X} failed: {}", cmd, esp_err_to_name(err));
  }
}

void Esp32P4ModuleDevKit::dsi_read_command(uint8_t cmd, std::span<uint8_t> data,
                                           uint32_t /*flags*/) {
  if (!lcd_handles_.io) {
    logger_.error("DSI read_command does not have a valid IO handle");
    return;
  }
  esp_err_t err = esp_lcd_panel_io_rx_param(lcd_handles_.io, (int)cmd, data.data(), data.size());
  if (err != ESP_OK) {
    logger_.error("DSI read_command 0x{:02X} failed: {}", cmd, esp_err_to_name(err));
  }
}

} // namespace espp
